"""
10) точка с координатами (x,y) принадлежит внутренней области 
треугольника с вершинами A(0,5), B(5,0) и C(1,0);
"""


# (x1 - x0) * (y2 - y1) - (x2 - x1) * (y1 - y0)
# (x2 - x0) * (y3 - y2) - (x3 - x2) * (y2 - y0)
# (x3 - x0) * (y1 - y3) - (x1 - x3) * (y3 - y0)


x, y = float(input()), float(input())

a = (0 - x) * (0 - 5) - (5 - 0) * (5 - y)
b = (5 - x) * (0 - 0) - (1 - 5) * (0 - y)
c = (1 - x) * (5 - 0) - (0 - 1) * (0 - y)

print(a>=0 and b>=0 and c>=0 or a<=0 and b<=0 and c<=0)

"""
11) точка с координатами (x,y) принадлежит области, внешней по 
отношению к треугольнику с вершинами A(0,5), B(1,0) и C(5,0); 
"""
a = (0 - x) * (0 - 5) - (1 - 0) * (5 - y)
b = (1 - x) * (0 - 0) - (5 - 1) * (0 - y)
c = (5 - x) * (5 - 0) - (0 - 5) * (0 - y)

print(not(a>=0 and b>=0 and c>=0 or a<=0 and b<=0 and c<=0))