"""
3.  Дано натуральное число. Приписать к нему такое же число.
"""

n = int(input())

m = n
k = 0
while m != 0:
    m //= 10
    k += 1

n = n * 10 ** k + n
print(n)